chronoweb/src/main/resources/webroot/example/poll/SimpleEventQuery_sensor/EQGTGELTLE_meanValue_uom.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:query="urn:epcglobal:epcis-query:xsd:2"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soapenv:Header />
	<soapenv:Body>
		<query:Poll>
			<queryName>SimpleEventQuery</queryName>
			<params>
				<param>
					<name>EQ_meanValue_CEL</name>
					<value xsi:type="xsd:double">23.0</value>
				</param>
				<param>
					<name>GT_meanValue_CEL</name>
					<value xsi:type="xsd:double">18.0</value>
				</param>
				<param>
					<name>GE_meanValue_FAH</name>
					<value xsi:type="xsd:double">-50</value>
				</param>
				<param>
					<name>LT_meanValue_KEL</name>
					<value xsi:type="xsd:double">525.0</value>
				</param>
				<param>
					<name>LE_meanValue_FAH</name>
					<value xsi:type="xsd:double">100</value>
				</param>
			</params>
		</query:Poll>
	</soapenv:Body>
</soapenv:Envelope>